Continued plan output from previous comment.
<details><summary>Show Output</summary>

```diff
                                 + 0,
                                    ]
                                  + type   = "gt"
                                }
                              + operator  = {
                                  + type = "and"
                                }
                              + query     = {
                                  + params = [
                                      + "E",
                                    ]
                                }
                              + reducer   = {
                                  + type = "avg"
                                }
                            },
                        ]
                      + refId      = "A"
                      + type       = "classic_conditions"
                    }
                )
              + ref_id         = "A"

              + relative_time_range {
                  + from = 0
                  + to   = 0
                }
            }
          + data {
              + datasource_uid = "grafanacloud-prom"
              + model          = jsonencode(
                    {
                      + datasource   = {
                          + type = "prometheus"
                          + uid  = "prometheus"
                        }
                      + editorMode   = "code"
                      + exemplar     = true
                      + expr         = "avg(node_sockstat_sockets_used{}) - (avg_over_time(avg(node_sockstat_sockets_used{})[24h:1m]) + 3 * stddev_over_time(avg(node_sockstat_sockets_used{})[24h:1m]))"
                      + instant      = false
                      + interval     = ""
                      + legendFormat = "alert"
                      + refId        = "E"
                    }
                )
              + ref_id         = "E"

              + relative_time_range {
                  + from = 300
                  + to   = 0
                }
            }
        }
    }

  # module.alerts[0].grafana_rule_group.alertrule["alertrules/Subnet IP usage alert.json"] will be created
  + resource "grafana_rule_group" "alertrule" {
      + disable_provenance = false
      + folder_uid         = (known after apply)
      + id                 = (known after apply)
      + interval_seconds   = 60
      + name               = "Subnet IP usage alert"

      + rule {
          + annotations    = {
              + "__alertId__"      = "153"
              + "__dashboardUid__" = "1NxY8ypGk"
              + "__panelId__"      = "2"
              + "message"          = "One or more subnets has a low count of available IP's < 500."
            }
          + condition      = "B"
          + exec_err_state = "Alerting"
          + for            = "5m"
          + is_paused      = false
          + labels         = {
              + "rule_uid" = "a3f8e90a-b38b-4244-9d38-c70cfe05d477"
            }
          + name           = "Subnet IP usage alert"
          + no_data_state  = "OK"
          + uid            = (known after apply)

          + data {
              + datasource_uid = "grafanacloud-prom"
              + model          = jsonencode(
                    {
                      + expr         = "sum by(tag, subnetid) (aws_subnet_exporter_available_ip{tag=~\".*eu.*\"}) "
                      + interval     = ""
                      + legendFormat = "availableIP:{{tag}}"
                      + refId        = "A"
                    }
                )
              + ref_id         = "A"

              + relative_time_range {
                  + from = 3600
                  + to   = 0
                }
            }
          + data {
              + datasource_uid = "__expr__"
              + model          = jsonencode(
                    {
                      + conditions = [
                          + {
                              + evaluator = {
                                  + params = [
                                      + 500,
                                    ]
                                  + type   = "lt"
                                }
                              + operator  = {
                                  + type = "and"
                                }
                              + query     = {
                                  + params = [
                                      + "A",
                                    ]
                                }
                              + reducer   = {
                                  + type = "avg"
                                }
                            },
                        ]
                      + refId      = "B"
                      + type       = "classic_conditions"
                    }
                )
              + ref_id         = "B"

              + relative_time_range {
                  + from = 0
                  + to   = 0
                }
            }
        }
    }

  # module.alerts[0].grafana_rule_group.alertrule["alertrules/Topic has large amount of consumergroups.json"] will be created
  + resource "grafana_rule_group" "alertrule" {
      + disable_provenance = false
      + folder_uid         = (known after apply)
      + id                 = (known after apply)
      + interval_seconds   = 60
      + name               = "Topic has large amount of consumergroups"

      + rule {
          + annotations    = {
              + "__alertId__"      = "166"
              + "__dashboardUid__" = "CoYn_3-nk"
              + "__panelId__"      = "4"
              + "message"          = "A topic has large amount of consumergroups. This might be due to someone creating unique consumergroups and hence eventually taking down the exporter for everybody, due to long request times."
            }
          + condition      = "B"
          + exec_err_state = "Alerting"
          + for            = "5m"
          + is_paused      = false
          + labels         = {
              + "rule_uid" = "c65dff93-ab8b-4f37-9670-e12fe4f26c75"
            }
          + name           = "Topic has large amount of consumergroups"
          + no_data_state  = "NoData"
          + uid            = (known after apply)

          + data {
              + datasource_uid = "grafanacloud-prom"
              + model          = jsonencode(
                    {
                      + datasource   = {
                          + type = "prometheus"
                          + uid  = "prometheus"
                        }
                      + exemplar     = true
                      + expr         = "count(kafka_consumergroup_lag) by (topic)"
                      + interval     = ""
                      + legendFormat = "{{topic}}"
                      + refId        = "A"
                    }
                )
              + ref_id         = "A"

              + relative_time_range {
                  + from = 300
                  + to   = 0
                }
            }
          + data {
              + datasource_uid = "__expr__"
              + model          = jsonencode(
                    {
                      + conditions = [
                          + {
                              + evaluator = {
                                  + params = [
                                      + 150,
                                    ]
                                  + type   = "gt"
                                }
                              + operator  = {
                                  + type = "and"
                                }
                              + query     = {
                                  + params = [
                                      + "A",
                                    ]
                                }
                              + reducer   = {
                                  + type = "avg"
                                }
                            },
                        ]
                      + refId      = "B"
                      + type       = "classic_conditions"
                    }
                )
              + ref_id         = "B"

              + relative_time_range {
                  + from = 0
                  + to   = 0
                }
            }
        }
    }

  # module.alerts[0].grafana_rule_group.alertrule["alertrules/VPC CNI unavailable alert.json"] will be created
  + resource "grafana_rule_group" "alertrule" {
      + disable_provenance = false
      + folder_uid         = (known after apply)
      + id                 = (known after apply)
      + interval_seconds   = 60
      + name               = "VPC CNI unavailable alert"

      + rule {
          + annotations    = {
              + "__alertId__"      = "170"
              + "__dashboardUid__" = "bj5-ZEhWk"
              + "__panelId__"      = "4"
              + "message"          = "One more instances of VPC CNI are unavailable! Please see \"Kubernetes Components\" dashboard for more details."
            }
          + condition      = "A"
          + exec_err_state = "Alerting"
          + for            = "1m"
          + is_paused      = false
          + labels         = {
              + "rule_uid" = "c8f6677c-18dc-423a-bc2a-191514348b6f"
            }
          + name           = "VPC CNI unavailable alert"
          + no_data_state  = "NoData"
          + uid            = (known after apply)

          + data {
              + datasource_uid = "__expr__"
              + model          = jsonencode(
                    {
                      + conditions = [
                          + {
                              + evaluator = {
                                  + params = [
                                      + 0.5,
                                    ]
                                  + type   = "gt"
                                }
                              + operator  = {
                                  + type = "and"
                                }
                              + query     = {
                                  + params = [
                                      + "B",
                                    ]
                                }
                              + reducer   = {
                                  + type = "avg"
                                }
                            },
                        ]
                      + refId      = "A"
                      + type       = "classic_conditions"
                    }
                )
              + ref_id         = "A"

              + relative_time_range {
                  + from = 0
                  + to   = 0
                }
            }
          + data {
              + datasource_uid = "grafanacloud-prom"
              + model          = jsonencode(
                    {
                      + expr           = "sum by (daemonset) (kube_daemonset_status_desired_number_scheduled{namespace=\"kube-system\", daemonset=\"aws-node\"}) - sum by (daemonset) (kube_daemonset_status_number_available{namespace=\"kube-system\", daemonset=\"aws-node\"})"
                      + format         = "time_series"
                      + intervalFactor = 2
                      + legendFormat   = "Unavailable"
                      + refId          = "B"
                    }
                )
              + ref_id         = "B"

              + relative_time_range {
                  + from = 300
                  + to   = 0
                }
            }
        }
    }

  # module.alerts[0].grafana_rule_group.alertrule["alertrules/Version alerts alert.json"] will be created
  + resource "grafana_rule_group" "alertrule" {
      + disable_provenance = false
      + folder_uid         = (known after apply)
      + id                 = (known after apply)
      + interval_seconds   = 60
      + name               = "Version alerts alert"

      + rule {
          + annotations    = {
              + "__alertId__"      = "161"
              + "__dashboardUid__" = "YMBzktpGz"
              + "__panelId__"      = "15"
              + "message"          = "Current Kubernetes cluster version is outdated"
            }
          + condition      = "B"
          + exec_err_state = "Alerting"
          + for            = "5m"
          + is_paused      = false
          + labels         = {
              + "repeat"   = "24h"
              + "rule_uid" = "b3144065-3094-4403-93dd-b7037b9f563d"
            }
          + name           = "Version alerts alert"
          + no_data_state  = "NoData"
          + uid            = (known after apply)

          + data {
              + datasource_uid = "grafanacloud-prom"
              + model          = jsonencode(
                    {
                      + datasource     = {
                          + type = "prometheus"
                          + uid  = "prometheus"
                        }
                      + expr           = "eks_version_exporter_is_outdated"
                      + format         = "time_series"
                      + instant        = false
                      + intervalFactor = 1
                      + legendFormat   = "is_outdated"
                      + refId          = "A"
                    }
                )
              + ref_id         = "A"

              + relative_time_range {
                  + from = 60
                  + to   = 0
                }
            }
          + data {
              + datasource_uid = "__expr__"
              + model          = jsonencode(
                    {
                      + conditions = [
                          + {
                              + evaluator = {
                                  + params = [
                                      + 0.9,
                                    ]
                                  + type   = "gt"
                                }
                              + operator  = {
                                  + type = "and"
                                }
                              + query     = {
                                  + params = [
                                      + "A",
                                    ]
                                }
                              + reducer   = {
                                  + type = "last"
                                }
                            },
                        ]
                      + refId      = "B"
                      + type       = "classic_conditions"
                    }
                )
              + ref_id         = "B"

              + relative_time_range {
                  + from = 0
                  + to   = 0
                }
            }
        }
    }

  # module.alerts[0].grafana_rule_group.alertrule["alertrules/Volume Snapshot Failure alert.json"] will be created
  + resource "grafana_rule_group" "alertrule" {
      + disable_provenance = false
      + folder_uid         = (known after apply)
      + id                 = (known after apply)
      + interval_seconds   = 60
      + name               = "Volume Snapshot Failure alert"

      + rule {
          + annotations    = {
              + "__alertId__"      = "183"
              + "__dashboardUid__" = "YAniUGC"
              + "__panelId__"      = "34"
              + "message"          = "A volume snapshot using Velero has failed.  Please check Velero to establish the cause of the failure."
            }
          + condition      = "B"
          + exec_err_state = "Alerting"
          + for            = "5m"
          + is_paused      = false
          + labels         = {
              + "rule_uid" = "b8eaf085-5c81-4d2a-b4a7-f2c6c9998e66"
            }
          + name           = "Volume Snapshot Failure alert"
          + no_data_state  = "NoData"
          + uid            = (known after apply)

          + data {
              + datasource_uid = "grafanacloud-prom"
              + model          = jsonencode(
                    {
                      + expr         = "rate(velero_volume_snapshot_failure_total{schedule=~\"velero-hellman-cluster-backup\"}[24h:])  "
                      + interval     = ""
                      + legendFormat = ""
                      + refId        = "A"
                    }
                )
              + ref_id         = "A"

              + relative_time_range {
                  + from = 300
                  + to   = 0
                }
            }
          + data {
              + datasource_uid = "__expr__"
              + model          = jsonencode(
                    {
                      + conditions = [
                          + {
                              + evaluator = {
                                  + params = [
                                      + 0,
                                    ]
                                  + type   = "gt"
                                }
                              + operator  = {
                                  + type = "and"
                                }
                              + query     = {
                                  + params = [
                                      + "A",
                                    ]
                                }
                              + reducer   = {
                                  + type = "last"
                                }
                            },
                        ]
                      + refId      = "B"
                      + type       = "classic_conditions"
                    }
                )
              + ref_id         = "B"

              + relative_time_range {
                  + from = 0
                  + to   = 0
                }
            }
        }
    }

  # module.alerts[0].grafana_rule_group.alertrule["alertrules/Watchdog.json"] will be created
  + resource "grafana_rule_group" "alertrule" {
      + disable_provenance = false
      + folder_uid         = (known after apply)
      + id                 = (known after apply)
      + interval_seconds   = 300
      + name               = "Watchdog"

      + rule {
          + condition      = "C"
          + exec_err_state = "Error"
          + for            = "5m"
          + is_paused      = false
          + labels         = {
              + "repeat" = "24h"
            }
          + name           = "Watchdog"
          + no_data_state  = "NoData"
          + uid            = (known after apply)

          + data {
              + datasource_uid = "grafanacloud-prom"
              + model          = jsonencode(
                    {
                      + editorMode = "code"
                      + expr       = "vector(1)"
                      + hide       = false
                      + instant    = true
                      + range      = false
                      + refId      = "A"
                    }
                )
              + ref_id         = "A"

              + relative_time_range {
                  + from = 600
                  + to   = 0
                }
            }
          + data {
              + datasource_uid = "__expr__"
              + model          = jsonencode(
                    {
                      + conditions = [
                          + {
                              + evaluator = {
                                  + params = []
                                  + type   = "gt"
                                }
                              + operator  = {
                                  + type = "and"
                                }
                              + query     = {
                                  + params = [
                                      + "B",
                                    ]
                                }
                              + reducer   = {
                                  + params = []
                                  + type   = "last"
                                }
                              + type      = "query"
                            },
                        ]
                      + datasource = {
                          + type = "__expr__"
                          + uid  = "__expr__"
                        }
                      + expression = "A"
                      + hide       = false
                      + reducer    = "last"
                      + refId      = "B"
                      + type       = "reduce"
                    }
                )
              + ref_id         = "B"

              + relative_time_range {
                  + from = 600
                  + to   = 0
                }
            }
          + data {
              + datasource_uid = "__expr__"
              + model          = jsonencode(
                    {
                      + conditions = [
                          + {
                              + evaluator = {
                                  + params = [
                                      + 0,
                                    ]
                                  + type   = "gt"
                                }
                              + operator  = {
                                  + type = "and"
                                }
                              + query     = {
                                  + params = [
                                      + "C",
                                    ]
                                }
                              + reducer   = {
                                  + params = []
                                  + type   = "last"
                                }
                              + type      = "query"
                            },
                        ]
                      + datasource = {
                          + type = "__expr__"
                          + uid  = "__expr__"
                        }
                      + expression = "B"
                      + hide       = false
                      + refId      = "C"
                      + type       = "threshold"
                    }
                )
              + ref_id         = "C"

              + relative_time_range {
                  + from = 600
                  + to   = 0
                }
            }
        }
    }

  # module.ce_folder.grafana_folder.this will be destroyed
  # (because module.ce_folder is not in configuration)
  - resource "grafana_folder" "this" {
      - id                           = "0:c3fd8820-e5b7-d60f-de99-4d1231726eed" -> null
      - org_id                       = "0" -> null
      - prevent_destroy_if_not_empty = false -> null
      - title                        = "Cloud Engineering" -> null
      - uid                          = "c3fd8820-e5b7-d60f-de99-4d1231726eed" -> null
      - url                          = "https://platform.grafana.dfds.cloud/dashboards/f/c3fd8820-e5b7-d60f-de99-4d1231726eed/cloud-engineering" -> null
    }

  # module.ce_folder.random_uuid.this will be destroyed
  # (because module.ce_folder is not in configuration)
  - resource "random_uuid" "this" {
      - id     = "c3fd8820-e5b7-d60f-de99-4d1231726eed" -> null
      - result = "c3fd8820-e5b7-d60f-de99-4d1231726eed" -> null
    }

  # module.ce_folder[0].grafana_folder.this will be created
  + resource "grafana_folder" "this" {
      + id                           = (known after apply)
      + prevent_destroy_if_not_empty = false
      + title                        = "Cloud Engineering"
      + uid                          = (known after apply)
      + url                          = (known after apply)
    }

  # module.ce_folder[0].random_uuid.this will be created
  + resource "random_uuid" "this" {
      + id     = (known after apply)
      + result = (known after apply)
    }

  # module.dashboards.grafana_dashboard.this["dashboards/1password-metrics.json"] will be destroyed
  # (because module.dashboards is not in configuration)
  - resource "grafana_dashboard" "this" {
      - config_json  = jsonencode(
            {
              - annotations                      = {
                  - list = [
                      - {
                          - builtIn    = 1
                          - datasource = {
                              - type = "datasource"
                              - uid  = "grafana"
                            }
                          - enable     = true
                          - hide       = true
                          - iconColor  = "rgba(0, 211, 255, 1)"
                          - name       = "Annotations & Alerts"
                          - target     = {
                              - limit    = 100
                              - matchAny = false
                              - tags     = []
                              - type     = "dashboard"
                            }
                          - type       = "dashboard"
                        },
                    ]
                }
              - description                      = ""
              - editable                         = true
              - fiscalYearStartMonth             = 0
              - graphTooltip                     = 0
              - links                            = []
              - liveNow                          = false
              - panels                           = [
                  - {
                      - datasource      = {
                          - type = "grafana-athena-datasource"
                          - uid  = "${datasource}"
                        }
                      - fieldConfig     = {
                          - defaults  = {
                              - color      = {
                                  - mode = "palette-classic"
                                }
                              - custom     = {
                                  - axisBorderShow    = false
                                  - axisCenteredZero  = false
                                  - axisColorMode     = "text"
                                  - axisLabel         = ""
                                  - axisPlacement     = "auto"
                                  - axisSoftMax       = 180
                                  - axisSoftMin       = 0
                                  - barAlignment      = 0
                                  - drawStyle         = "line"
                                  - fillOpacity       = 25
                                  - gradientMode      = "none"
                                  - hideFrom          = {
                                      - legend  = false
                                      - tooltip = false
                                      - viz     = false
                                    }
                                  - insertNulls       = false
                                  - lineInterpolation = "smooth"
                                  - lineWidth         = 1
                                  - pointSize         = 5
                                  - scaleDistribution = {
                                      - type = "linear"
                                    }
                                  - showPoints        = "auto"
                                  - spanNulls         = true
                                  - stacking          = {
                                      - group = "A"
                                      - mode  = "normal"
                                    }
                                  - thresholdsStyle   = {
                                      - mode = "dashed"
                                    }
                                }
                              - mappings   = []
                              - thresholds = {
                                  - mode  = "absolute"
                                  - steps = [
                                      - {
                                          - color = "green"
                                          - value = null
                                        },
                                      - {
                                          - color = "red"
                                          - value = 180
                                        },
                                    ]
                                }
                            }
                          - overrides = [
                              - {
                                  - matcher    = {
                                      - id      = "byName"
                                      - options = "Dormant users"
                                    }
                                  - properties = [
                                      - {
                                          - id    = "custom.fillOpacity"
                                          - value = 5
                                        },
                                    ]
                                },
                            ]
                        }
                      - gridPos         = {
                          - h = 8
                          - w = 11
                          - x = 0
                          - y = 0
                        }
                      - options         = {
                          - legend  = {
                              - calcs       = []
                              - displayMode = "list"
                              - placement   = "bottom"
                              - showLegend  = true
                            }
                          - tooltip = {
                              - mode = "single"
                              - sort = "none"
                            }
                        }
                      - targets         = [
                          - {
                              - column         = "active_user_count"
                              - connectionArgs = {
                                  - catalog  = "__default"
                                  - database = "__default"
                                  - region   = "__default"
                                }
                              - datasource     = {
                                  - type = "grafana-athena-datasource"
                                  - uid  = "${datasource}"
                                }
                              - format         = 0
                              - rawSQL         = <<-EOT
                                    SELECT "date", active_user_count as "Active users", total_user_count-active_user_count as "Dormant users" FROM "1password"."1password_service_adoption_metrics" order by "date" ASC
                                EOT
                              - refId          = "A"
                              - table          = "1password_service_adoption_metrics"
                            },
                        ]
                      - title           = "Users"
                      - transformations = [
                          - {
                              - id      = "filterByValue"
                              - options = {
                                  - filters = [
                                      - {
                                          - config    = {
                                              - id      = "lowerOrEqual"
                                              - options = {
                                                  - value = 0
                                                }
                                            }
                                          - fieldName = "Active users"
                                        },
                                      - {
                                          - config    = {
                                              - id      = "lowerOrEqual"
                                              - options = {
                                                  - value = 0
                                                }
                                            }
                                          - fieldName = "Dormant users"
                                        },
                                    ]
                                  - match   = "any"
                                  - type    = "exclude"
                                }
                            },
                        ]
                      - transparent     = true
                      - type            = "timeseries"
                    },
                  - {
                      - datasource      = {
                          - type = "grafana-athena-datasource"
                          - uid  = "${datasource}"
                        }
                      - fieldConfig     = {
                          - defaults  = {
                              - color      = {
                                  - mode = "palette-classic"
                                }
                              - custom     = {
                                  - axisBorderShow    = false
                                  - axisCenteredZero  = false
                                  - axisColorMode     = "text"
                                  - axisLabel         = ""
                                  - axisPlacement     = "auto"
                                  - barAlignment      = 0
                                  - drawStyle         = "line"
                                  - fillOpacity       = 25
                                  - gradientMode      = "none"
                                  - hideFrom          = {
                                      - legend  = false
                                      - tooltip = false
                                      - viz     = false
                                    }
                                  - insertNulls       = false
                                  - lineInterpolation = "smooth"
                                  - lineWidth         = 1
                                  - pointSize         = 5
                                  - scaleDistribution = {
                                      - type = "linear"
                                    }
                                  - showPoints        = "auto"
                                  - spanNulls         = false
                                  - stacking          = {
                                      - group = "A"
                                      - mode  = "none"
                                    }
                                  - thresholdsStyle   = {
                                      - mode = "off"
                                    }
                                }
                              - mappings   = []
                              - thresholds = {
                                  - mode  = "absolute"
                                  - steps = [
                                      - {
                                          - color = "green"
                                          - value = null
                                        },
                                      - {
                                          - color = "red"
                                          - value = 80
                                        },
                                    ]
                                }
                            }
                          - overrides = []
                        }
                      - gridPos         = {
                          - h = 6
                          - w = 12
                          - x = 11
                          - y = 0
                        }
                      - options         = {
                          - legend  = {
                              - calcs       = [
                                  - "last",
                                ]
                              - displayMode = "list"
                              - placement   = "bottom"
                              - showLegend  = true
                            }
                          - tooltip = {
                              - mode = "single"
                              - sort = "none"
                            }
                        }
                      - pluginVersion   = "9.3.2"
                      - targets         = [
                          - {
                              - connectionArgs = {
                                  - catalog  = "__default"
                                  - database = "__default"
                                  - region   = "__default"
                                }
                              - datasource     = {
                                  - type = "grafana-athena-datasource"
                                  - uid  = "${datasource}"
                                }
                              - format         = 1
                              - rawSQL         = "SELECT \"date\", total_items_in_shared_vaults as \"Vault-Items\" FROM \"1password\".\"1password_service_adoption_metrics\" order by \"date\" ASC;"
                              - refId          = "A"
                            },
                        ]
                      - title           = "Total Number of Items in Shared Vaults"
                      - transformations = [
                          - {
                              - id      = "filterByValue"
                              - options = {
                                  - filters = [
                                      - {
                                          - config    = {
                                              - id      = "lowerOrEqual"
                                              - options = {
                                                  - value = 0
                                                }
                                            }
                                          - fieldName = "Vault-Items"
                                        },
                                    ]
                                  - match   = "any"
                                  - type    = "exclude"
                                }
                            },
                        ]
                      - transparent     = true
                      - type            = "timeseries"
                    },
                  - {
                      - datasource    = {
                          - type = "grafana-athena-datasource"
                          - uid  = "${datasource}"
                        }
                      - fieldConfig   = {
                          - defaults  = {
                              - color      = {
                                  - mode = "continuous-BlPu"
                                }
                              - custom     = {
                                  - axisBorderShow    = false
                                  - axisCenteredZero  = false
                                  - axisColorMode     = "text"
                                  - axisLabel         = ""
                                  - axisPlacement     = "auto"
                                  - barAlignment      = 0
                                  - drawStyle         = "line"
                                  - fillOpacity       = 20
                                  - gradientMode      = "scheme"
                                  - hideFrom          = {
                                      - legend  = false
                                      - tooltip = false
                                      - viz     = false
                                    }
                                  - insertNulls       = false
                                  - lineInterpolation = "smooth"
                                  - lineWidth         = 3
                                  - pointSize         = 5
                                  - scaleDistribution = {
                                      - type = "linear"
                                    }
                                  - showPoints        = "auto"
                                  - spanNulls         = false
                                  - stacking          = {
                                      - group = "A"
                                      - mode  = "none"
                                    }
                                  - thresholdsStyle   = {
                                      - mode = "off"
                                    }
                                }
                              - mappings   = []
                              - thresholds = {
                                  - mode  = "absolute"
                                  - steps = [
                                      - {
                                          - color = "green"
                                          - value = null
                                        },
                                      - {
                                          - color = "red"
                                          - value = 80
                                        },
                                    ]
                                }
                            }
                          - overrides = [
                              - {
                                  - matcher    = {
                                      - id      = "byName"
                                      - options = "total_item_usage_events"
                                    }
                                  - properties = [
                                      - {
                                          - id    = "displayName"
                                          - value = "Usage Events"
                                        },
                                    ]
                                },
                            ]
                        }
                      - gridPos       = {
                          - h = 8
                          - w = 12
                          - x = 11
                          - y = 6
                        }
                      - options       = {
                          - legend  = {
                              - calcs       = []
                              - displayMode = "list"
                              - placement   = "bottom"
                              - showLegend  = true
                            }
                          - tooltip = {
                              - mode = "single"
                              - sort = "none"
                            }
                        }
                      - pluginVersion = "9.3.2"
                      - targets       = [
                          - {
                              - connectionArgs = {
                                  - catalog  = "__default"
                                  - database = "__default"
                                  - region   = "__default"
                                }
                              - datasource     = {
                                  - type = "grafana-athena-datasource"
                                  - uid  = "${datasource}"
                                }
                              - format         = 1
                              - rawSQL         = "SELECT \"date\", total_item_usage_events FROM \"1password\".\"1password_service_adoption_metrics\" ORDER BY \"date\" ASC "
                              - refId          = "A"
                              - table          = "1password_service_adoption_metrics"
                            },
                        ]
                      - title         = "Usage of Items in Shared Vaults"
                      - type          = "timeseries"
                    },
                  - {
                      - datasource    = {
                          - type = "grafana-athena-datasource"
                          - uid  = "${datasource}"
                        }
                      - description   = ""
                      - fieldConfig   = {
                          - defaults  = {
                              - displayName = "Active User Count"
                              - mappings    = []
                              - max         = 280
                              - thresholds  = {
                                  - mode  = "absolute"
                                  - steps = [
                                      - {
                                          - color = "green"
                                          - value = null
                                        },
                                      - {
                                          - color = "orange"
                                          - value = 265
                                        },
                                      - {
                                          - color = "red"
                                          - value = 275
                                        },
                                    ]
                                }
                            }
                          - overrides = []
                        }
                      - gridPos       = {
                          - h = 8
                          - w = 11
                          - x = 0
                          - y = 8
                        }
                      - options       = {
                          - minVizHeight         = 75
                          - minVizWidth          = 75
                          - orientation          = "auto"
                          - reduceOptions        = {
                              - calcs  = [
                                  - "lastNotNull",
                                ]
                              - fields = ""
                              - values = false
                            }
                          - showThresholdLabels  = false
                          - showThresholdMarkers = true
                          - sizing               = "auto"
                        }
                      - pluginVersion = "11.1.0-69950"
                      - targets       = [
                          - {
                              - connectionArgs = {
                                  - catalog  = "__default"
                                  - database = "__default"
                                  - region   = "__default"
                                }
                              - datasource     = {
                                  - type = "grafana-athena-datasource"
                                  - uid  = "${datasource}"
                                }
                              - format         = 1
                              - rawSQL         = "SELECT active_user_count FROM \"1password\".\"1password_service_adoption_metrics\""
                              - refId          = "A"
                            },
                        ]
                      - transparent   = true
                      - type          = "gauge"
                    },
                  - {
                      - datasource      = {
                          - type = "grafana-athena-datasource"
                          - uid  = "${datasource}"
                        }
                      - fieldConfig     = {
                          - defaults  = {
                              - color      = {
                                  - mode = "continuous-BlPu"
                                }
                              - mappings   = []
                              - thresholds = {
                                  - mode  = "absolute"
                                  - steps = [
                                      - {
                                          - color = "green"
                                          - value = null
                                        },
                                    ]
                                }
                            }
                          - overrides = [
                              - {
                                  - matcher    = {
                                      - id      = "byName"
                                      - options = "total_items_in_shared_vaults"
                                    }
                                  - properties = [
                                      - {
                                          - id    = "displayName"
                                          - value = "Items in Vaults"
                                        },
                                    ]
                                },
                              - {
                                  - matcher    = {
                                      - id      = "byName"
                                      - options = "num_of_shared_vaults"
                                    }
                                  - properties = [
                                      - {
                                          - id    = "displayName"
                                          - value = "Shared Vaults"
                                        },
                                    ]
                                },
                            ]
                        }
                      - gridPos         = {
                          - h = 6
                          - w = 12
                          - x = 11
                          - y = 14
                        }
                      - options         = {
                          - colorMode         = "value"
                          - graphMode         = "area"
                          - justifyMode       = "auto"
                          - orientation       = "auto"
                          - reduceOptions     = {
                              - calcs  = [
                                  - "lastNotNull",
                                ]
                              - fields = ""
                              - values = false
                            }
                          - showPercentChange = false
                          - textMode          = "auto"
                          - wideLayout        = true
                        }
                      - pluginVersion   = "11.1.0-69950"
                      - targets         = [
                          - {
                              - connectionArgs = {
                                  - catalog  = "__default"
                                  - database = "__default"
                                  - region   = "__default"
                                }
                              - datasource     = {
                                  - type = "grafana-athena-datasource"
                                  - uid  = "${datasource}"
                                }
                              - format         = 1
                              - rawSQL         = "SELECT \"date\", num_of_shared_vaults FROM \"1password\".\"1password_service_adoption_metrics\" ORDER BY \"date\" ASC"
                              - refId          = "A"
                            },
                        ]
                      - title           = "Number of Shared Vaults"
                      - transformations = [
                          - {
                              - id      = "filterByValue"
                              - options = {
                                  - filters = [
                                      - {
                                          - config    = {
                                              - id      = "lowerOrEqual"
                                              - options = {
                                                  - value = 0
                                                }
                                            }
                                          - fieldName = "num_of_shared_vaults"
                                        },
                                    ]
                                  - match   = "any"
                                  - type    = "exclude"
                                }
                            },
                        ]
                      - transparent     = true
                      - type            = "stat"
                    },
                  - {
                      - datasource    = {
                          - type = "grafana-athena-datasource"
                          - uid  = "${datasource}"
                        }
                      - description   = ""
                      - fieldConfig   = {
                          - defaults  = {
                              - color       = {
                                  - mode = "continuous-BlYlRd"
                                }
                              - displayName = "Inactive Users"
                              - mappings    = []
                              - max         = 240
                              - thresholds  = {
                                  - mode  = "absolute"
                                  - steps = [
                                      - {
                                          - color = "green"
                                          - value = null
                                        },
                                      - {
                                          - color = "orange"
                                          - value = 140
                                        },
                                      - {
                                          - color = "red"
                                          - value = 160
                                        },
                                    ]
                                }
                            }
                          - overrides = []
                        }
                      - gridPos       = {
                          - h = 8
                          - w = 11
                          - x = 0
                          - y = 16
                        }
                      - options       = {
                          - minVizHeight         = 75
                          - minVizWidth          = 75
                          - orientation          = "auto"
                          - reduceOptions        = {
                              - calcs  = [
                                  - "lastNotNull",
                                ]
                              - fields = ""
                              - values = false
                            }
                          - showThresholdLabels  = false
                          - showThresholdMarkers = true
                          - sizing               = "auto"
                        }
                      - pluginVersion = "11.1.0-69950"
                      - targets       = [
                          - {
                              - connectionArgs = {
                                  - catalog  = "__default"
                                  - database = "__default"
                                  - region   = "__default"
                                }
                              - datasource     = {
                                  - type = "grafana-athena-datasource"
                                  - uid  = "${datasource}"
                                }
                              - format         = 1
                              - rawSQL         = "SELECT total_user_count-active_user_count as \"Inactive Users\" FROM \"1password\".\"1password_service_adoption_metrics\";"
                              - refId          = "A"
                            },
                        ]
                      - transparent   = true
                      - type          = "gauge"
                    },
                ]
              - refresh                          = ""
              - schemaVersion                    = 39
              - tags                             = [
                  - "Adoption",
                  - "1Password",
                ]
              - templating                       = {
                  - list = [
                      - {
                          - current     = {
                              - selected = false
                              - text     = "Athena-1Password"
                              - value    = "athena-grafana"
                            }
                          - hide        = 0
                          - includeAll  = false
                          - multi       = false
                          - name        = "datasource"
                          - options     = []
                          - query       = "grafana-athena-datasource"
                          - refresh     = 1
                          - regex       = ""
                          - skipUrlSync = false
                          - type        = "datasource"
                        },
                    ]
                }
              - time                             = {
                  - from = "now-30d"
                  - to   = "now"
                }
              - timeRangeUpdatedDuringEditOrView = false
              - timepicker                       = {}
              - timezone                         = ""
              - title                            = "1Password Adoption"
              - uid                              = "1password_metrics_adoption"
              - weekStart                        = ""
            }
        ) -> null
      - dashboard_id = 44 -> null
      - folder       = "c3fd8820-e5b7-d60f-de99-4d1231726eed" -> null
      - id           = "0:1password_metrics_adoption" -> null
      - org_id       = "0" -> null
      - overwrite    = true -> null
      - uid          = "1password_metrics_adoption" -> null
      - url          = "https://platform.grafana.dfds.cloud/d/1password_metrics_adoption/1password-adoption" -> null
      - version      = 1 -> null
    }

  # module.dashboards.grafana_dashboard.this["dashboards/1password-scimbridge.json"] will be destroyed
  # (because module.dashboards is not in configuration)
  - resource "grafana_dashboard" "this" {
      - config_json  = jsonencode(
            {
              - annotations          = {
                  - list = [
                      - {
                          - builtIn    = 1
                          - datasource = {
                              - type = "datasource"
                              - uid  = "grafana"
                            }
                          - enable     = true
                          - hide       = true
                          - iconColor  = "rgba(0, 211, 255, 1)"
                          - name       = "Annotations & Alerts"
                          - target     = {
                              - limit    = 100
                              - matchAny = false
                              - tags     = []
                              - type     = "dashboard"
                            }
                          - type       = "dashboard"
                        },
                    ]
                }
              - description          = "Scimbridge deployment monitoring Prod"
              - editable             = true
              - fiscalYearStartMonth = 0
              - gnetId               = 7587
              - graphTooltip         = 0
              - links                = []
              - liveNow              = false
              - panels               = [
                  - {
                      - datasource    = {
                          - type = "prometheus"
                          - uid  = "${datasource}"
                        }
                      - fieldConfig   = {
                          - defaults  = {
                              - color      = {
                                  - mode = "thresholds"
                                }
                              - mappings   = []
                              - thresholds = {
                                  - mode  = "absolute"
                                  - steps = [
                                      - {
                                          - color = "green"
                                          - value = null
                                        },
                                      - {
                                          - color = "red"
                                          - value = 80
                                        },
                                    ]
                                }
                              - unitScale  = true
                            }
                          - overrides = []
                        }
                      - gridPos       = {
                          - h = 4
                          - w = 3
                          - x = 0
                          - y = 0
                        }
                      - options       = {
                          - colorMode         = "value"
                          - graphMode         = "area"
                          - justifyMode       = "auto"
                          - orientation       = "auto"
                          - reduceOptions     = {
                              - calcs  = [
                                  - "lastNotNull",
                                ]
                              - fields = ""
                              - values = false
                            }
                          - showPercentChange = false
                          - text              = {}
                          - textMode          = "name"
                          - wideLayout        = true
                        }
                      - pluginVersion = "10.4.0-65875"
                      - targets       = [
                          - {
                              - datasource   = {
                                  - type = "prometheus"
                                  - uid  = "${datasource}"
                                }
                              - editorMode   = "code"
                              - exemplar     = false
                              - expr         = "helm_chart_info{cluster=\"$cluster\",namespace=\"$namespace\", chart=\"$helm_chart_name\", release=\"$helm_release_name\"}"
                              - instant      = true
                              - interval     = ""
                              - legendFormat = "{{latestVersion}}"
                              - range        = false
                              - refId        = "A"
                            },
                        ]
                      - title         = "Latest available Chart version"
                      - type          = "stat"
                    },
                  - {
                      - datasource    = {
                          - type = "prometheus"
                          - uid  = "${datasource}"
                        }
                      - fieldConfig   = {
                          - defaults  = {
                              - color      = {
                                  - mode = "thresholds"
                                }
                              - custom     = {
                                  - align       = "left"
                                  - cellOptions = {
                                      - type = "auto"
                                    }
                                  - inspect     = false
                                  - minWidth    = 50
                                }
                              - mappings   = []
                              - thresholds = {
                                  - mode  = "absolute"
                                  - steps = [
                                      - {
                                          - color = "green"
                                          - value = null
                                        },
                                      - {
                                          - color = "red"
                                          - value = 80
                                        },
                                    ]
                                }
                              - unitScale  = true
                            }
                          - overrides = [
                              - {
                                  - matcher    = {
                                      - id      = "byName"
                                      - options = "Time"
                                    }
                                  - properties = [
                                      - {
                                          - id    = "custom.hidden"
                                          - value = true
                                 
```
</details>
<br>

**Warning**: Output length greater than max comment size. Continued in next comment.